analysis/results/cockroachdb/log_cockroachdb_b_run1.txt
/opt/java/openjdk/bin/java -cp /opt/ycsb/jdbc-binding/conf:/opt/ycsb/conf:/opt/ycsb/lib/core-0.17.0.jar:/opt/ycsb/lib/HdrHistogram-2.1.4.jar:/opt/ycsb/lib/jackson-mapper-asl-1.9.4.jar:/opt/ycsb/lib/htrace-core4-4.1.0-incubating.jar:/opt/ycsb/lib/jackson-core-asl-1.9.4.jar:/opt/ycsb/jdbc-binding/lib/commons-lang-2.4.jar:/opt/ycsb/jdbc-binding/lib/openjpa-lib-2.1.1.jar:/opt/ycsb/jdbc-binding/lib/serp-1.13.1.jar:/opt/ycsb/jdbc-binding/lib/openjpa-kernel-2.1.1.jar:/opt/ycsb/jdbc-binding/lib/commons-pool-1.5.4.jar:/opt/ycsb/jdbc-binding/lib/commons-collections-3.2.1.jar:/opt/ycsb/jdbc-binding/lib/geronimo-jms_1.1_spec-1.1.1.jar:/opt/ycsb/jdbc-binding/lib/geronimo-jta_1.1_spec-1.1.1.jar:/opt/ycsb/jdbc-binding/lib/jdbc-binding-0.17.0.jar:/opt/ycsb/jdbc-binding/lib/openjpa-jdbc-2.1.1.jar:/opt/ycsb/jdbc-binding/lib/postgresql-42.7.3.jar site.ycsb.Client -db site.ycsb.db.JdbcDBClient -P /workloads/workload_b.properties -p db.driver=org.postgresql.Driver -p db.url=jdbc:postgresql://crdb1:26257/ycsb?sslmode=disable -p db.user=root -p db.passwd= -p db.batchsize=100 -p jdbc.autocommit=true -p recordcount=1000000 -p operationcount=1000000 -p threadcount=16 -t
Command line: -db site.ycsb.db.JdbcDBClient -P /workloads/workload_b.properties -p db.driver=org.postgresql.Driver -p db.url=jdbc:postgresql://crdb1:26257/ycsb?sslmode=disable -p db.user=root -p db.passwd= -p db.batchsize=100 -p jdbc.autocommit=true -p recordcount=1000000 -p operationcount=1000000 -p threadcount=16 -t
YCSB Client 0.17.0

Loading workload...
Starting test.
Adding shard node URL: jdbc:postgresql://crdb1:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://crdb1:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://crdb1:26257/ycsb?sslmode=disable
[...]
Using shards: 1, batchSize:100, fetchSize: -1
Using shards: 1, batchSize:100, fetchSize: -1
Using shards: 1, batchSize:100, fetchSize: -1
[...]
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
[...]
[OVERALL], RunTime(ms), 401038
[OVERALL], Throughput(ops/sec), 2493.529291488587
[TOTAL_GCS_G1_Young_Generation], Count, 14
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 113
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.028176880993821037
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 14
[TOTAL_GC_TIME], Time(ms), 113
[TOTAL_GC_TIME_%], Time(%), 0.028176880993821037
[READ], Operations, 949877
[READ], AverageLatency(us), 5759.662593156798
[READ], MinLatency(us), 362
[READ], MaxLatency(us), 2310143
[READ], 95thPercentileLatency(us), 11727
[READ], 99thPercentileLatency(us), 17183
[READ], Return=OK, 949877
[CLEANUP], Operations, 16
[CLEANUP], AverageLatency(us), 257.1875
[CLEANUP], MinLatency(us), 170
[CLEANUP], MaxLatency(us), 676
[CLEANUP], 95thPercentileLatency(us), 335
[CLEANUP], 99thPercentileLatency(us), 676
[UPDATE], Operations, 50123
[UPDATE], AverageLatency(us), 18353.958083115536
[UPDATE], MinLatency(us), 3282
[UPDATE], MaxLatency(us), 2428927
[UPDATE], 95thPercentileLatency(us), 28927
[UPDATE], 99thPercentileLatency(us), 108991
[UPDATE], Return=OK, 50123